OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12lf1572.h
#define RA0                     PORTAbits.RA0                   // bit 0
#define RA1                     PORTAbits.RA1                   // bit 1
#define RA2                     PORTAbits.RA2                   // bit 2
#define RA3                     PORTAbits.RA3                   // bit 3
#define RA4                     PORTAbits.RA4                   // bit 4
#define RA5                     PORTAbits.RA5                   // bit 5

#define PWM1MODE0               PWM1CONbits.PWM1MODE0           // bit 2, shadows bit in PWM1CONbits
#define MODE0                   PWM1CONbits.MODE0               // bit 2, shadows bit in PWM1CONbits
#define PWM1MODE1               PWM1CONbits.PWM1MODE1           // bit 3, shadows bit in PWM1CONbits
#define MODE1                   PWM1CONbits.MODE1               // bit 3, shadows bit in PWM1CONbits
#define POL                     PWM1CONbits.POL                 // bit 4, shadows bit in PWM1CONbits
#define PWM1POL                 PWM1CONbits.PWM1POL             // bit 4, shadows bit in PWM1CONbits
#define OUT                     PWM1CONbits.OUT                 // bit 5, shadows bit in PWM1CONbits
#define PWM1OUT                 PWM1CONbits.PWM1OUT             // bit 5, shadows bit in PWM1CONbits
#define OE                      PWM1CONbits.OE                  // bit 6, shadows bit in PWM1CONbits
#define PWM1OE                  PWM1CONbits.PWM1OE              // bit 6, shadows bit in PWM1CONbits
#define EN                      PWM1CONbits.EN                  // bit 7, shadows bit in PWM1CONbits
#define PWM1EN                  PWM1CONbits.PWM1EN              // bit 7, shadows bit in PWM1CONbits

#define PWM1DCH0                PWM1DCHbits.PWM1DCH0            // bit 0
#define PWM1DCH1                PWM1DCHbits.PWM1DCH1            // bit 1
#define PWM1DCH2                PWM1DCHbits.PWM1DCH2            // bit 2
#define PWM1DCH3                PWM1DCHbits.PWM1DCH3            // bit 3
#define PWM1DCH4                PWM1DCHbits.PWM1DCH4            // bit 4
#define PWM1DCH5                PWM1DCHbits.PWM1DCH5            // bit 5
#define PWM1DCH6                PWM1DCHbits.PWM1DCH6            // bit 6
#define PWM1DCH7                PWM1DCHbits.PWM1DCH7            // bit 7

#define PWM1DCL0                PWM1DCLbits.PWM1DCL0            // bit 0
#define PWM1DCL1                PWM1DCLbits.PWM1DCL1            // bit 1
#define PWM1DCL2                PWM1DCLbits.PWM1DCL2            // bit 2
#define PWM1DCL3                PWM1DCLbits.PWM1DCL3            // bit 3
#define PWM1DCL4                PWM1DCLbits.PWM1DCL4            // bit 4
#define PWM1DCL5                PWM1DCLbits.PWM1DCL5            // bit 5
#define PWM1DCL6                PWM1DCLbits.PWM1DCL6            // bit 6
#define PWM1DCL7                PWM1DCLbits.PWM1DCL7            // bit 7

#define PRIE                    PWM1INTCONbits.PRIE             // bit 0, shadows bit in PWM1INTCONbits
#define PWM1PRIE                PWM1INTCONbits.PWM1PRIE         // bit 0, shadows bit in PWM1INTCONbits
#define DCIE                    PWM1INTCONbits.DCIE             // bit 1, shadows bit in PWM1INTCONbits
#define PWM1DCIE                PWM1INTCONbits.PWM1DCIE         // bit 1, shadows bit in PWM1INTCONbits
#define PHIE                    PWM1INTCONbits.PHIE             // bit 2, shadows bit in PWM1INTCONbits
#define PWM1PHIE                PWM1INTCONbits.PWM1PHIE         // bit 2, shadows bit in PWM1INTCONbits
#define OFIE                    PWM1INTCONbits.OFIE             // bit 3, shadows bit in PWM1INTCONbits
#define PWM1OFIE                PWM1INTCONbits.PWM1OFIE         // bit 3, shadows bit in PWM1INTCONbits

#define PRIF                    PWM1INTFbits.PRIF               // bit 0, shadows bit in PWM1INTFbits
#define PWM1PRIF                PWM1INTFbits.PWM1PRIF           // bit 0, shadows bit in PWM1INTFbits
#define DCIF                    PWM1INTFbits.DCIF               // bit 1, shadows bit in PWM1INTFbits
#define PWM1DCIF                PWM1INTFbits.PWM1DCIF           // bit 1, shadows bit in PWM1INTFbits
#define PHIF                    PWM1INTFbits.PHIF               // bit 2, shadows bit in PWM1INTFbits
#define PWM1PHIF                PWM1INTFbits.PWM1PHIF           // bit 2, shadows bit in PWM1INTFbits
#define OFIF                    PWM1INTFbits.OFIF               // bit 3, shadows bit in PWM1INTFbits
#define PWM1OFIF                PWM1INTFbits.PWM1OFIF           // bit 3, shadows bit in PWM1INTFbits

#define PWM1LDS0                PWM1LDCONbits.PWM1LDS0          // bit 0, shadows bit in PWM1LDCONbits
#define LDS0                    PWM1LDCONbits.LDS0              // bit 0, shadows bit in PWM1LDCONbits
#define PWM1LDS1                PWM1LDCONbits.PWM1LDS1          // bit 1, shadows bit in PWM1LDCONbits
#define LDS1                    PWM1LDCONbits.LDS1              // bit 1, shadows bit in PWM1LDCONbits
#define LDT                     PWM1LDCONbits.LDT               // bit 6, shadows bit in PWM1LDCONbits
#define PWM1LDM                 PWM1LDCONbits.PWM1LDM           // bit 6, shadows bit in PWM1LDCONbits
#define LDA                     PWM1LDCONbits.LDA               // bit 7, shadows bit in PWM1LDCONbits
#define PWM1LD                  PWM1LDCONbits.PWM1LD            // bit 7, shadows bit in PWM1LDCONbits

#define PWM1OFS0                PWM1OFCONbits.PWM1OFS0          // bit 0, shadows bit in PWM1OFCONbits
#define OFS0                    PWM1OFCONbits.OFS0              // bit 0, shadows bit in PWM1OFCONbits
#define PWM1OFS1                PWM1OFCONbits.PWM1OFS1          // bit 1, shadows bit in PWM1OFCONbits
#define OFS1                    PWM1OFCONbits.OFS1              // bit 1, shadows bit in PWM1OFCONbits
#define OFO                     PWM1OFCONbits.OFO               // bit 4, shadows bit in PWM1OFCONbits
#define PWM1OFMC                PWM1OFCONbits.PWM1OFMC          // bit 4, shadows bit in PWM1OFCONbits
#define PWM1OFM0                PWM1OFCONbits.PWM1OFM0          // bit 5, shadows bit in PWM1OFCONbits
#define OFM0                    PWM1OFCONbits.OFM0              // bit 5, shadows bit in PWM1OFCONbits
#define PWM1OFM1                PWM1OFCONbits.PWM1OFM1          // bit 6, shadows bit in PWM1OFCONbits
#define OFM1                    PWM1OFCONbits.OFM1              // bit 6, shadows bit in PWM1OFCONbits

#define PWM1OFH0                PWM1OFHbits.PWM1OFH0            // bit 0
#define PWM1OFH1                PWM1OFHbits.PWM1OFH1            // bit 1
#define PWM1OFH2                PWM1OFHbits.PWM1OFH2            // bit 2
#define PWM1OFH3                PWM1OFHbits.PWM1OFH3            // bit 3
#define PWM1OFH4                PWM1OFHbits.PWM1OFH4            // bit 4
#define PWM1OFH5                PWM1OFHbits.PWM1OFH5            // bit 5
#define PWM1OFH6                PWM1OFHbits.PWM1OFH6            // bit 6
#define PWM1OFH7                PWM1OFHbits.PWM1OFH7            // bit 7

