OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12lf1572.h
#define PWM2TMRH0               PWM2TMRHbits.PWM2TMRH0          // bit 0
#define PWM2TMRH1               PWM2TMRHbits.PWM2TMRH1          // bit 1
#define PWM2TMRH2               PWM2TMRHbits.PWM2TMRH2          // bit 2
#define PWM2TMRH3               PWM2TMRHbits.PWM2TMRH3          // bit 3
#define PWM2TMRH4               PWM2TMRHbits.PWM2TMRH4          // bit 4
#define PWM2TMRH5               PWM2TMRHbits.PWM2TMRH5          // bit 5
#define PWM2TMRH6               PWM2TMRHbits.PWM2TMRH6          // bit 6
#define PWM2TMRH7               PWM2TMRHbits.PWM2TMRH7          // bit 7

#define PWM2TMRL0               PWM2TMRLbits.PWM2TMRL0          // bit 0
#define PWM2TMRL1               PWM2TMRLbits.PWM2TMRL1          // bit 1
#define PWM2TMRL2               PWM2TMRLbits.PWM2TMRL2          // bit 2
#define PWM2TMRL3               PWM2TMRLbits.PWM2TMRL3          // bit 3
#define PWM2TMRL4               PWM2TMRLbits.PWM2TMRL4          // bit 4
#define PWM2TMRL5               PWM2TMRLbits.PWM2TMRL5          // bit 5
#define PWM2TMRL6               PWM2TMRLbits.PWM2TMRL6          // bit 6
#define PWM2TMRL7               PWM2TMRLbits.PWM2TMRL7          // bit 7

#define PWM3DCH0                PWM3DCHbits.PWM3DCH0            // bit 0
#define PWM3DCH1                PWM3DCHbits.PWM3DCH1            // bit 1
#define PWM3DCH2                PWM3DCHbits.PWM3DCH2            // bit 2
#define PWM3DCH3                PWM3DCHbits.PWM3DCH3            // bit 3
#define PWM3DCH4                PWM3DCHbits.PWM3DCH4            // bit 4
#define PWM3DCH5                PWM3DCHbits.PWM3DCH5            // bit 5
#define PWM3DCH6                PWM3DCHbits.PWM3DCH6            // bit 6
#define PWM3DCH7                PWM3DCHbits.PWM3DCH7            // bit 7

#define PWM3DCL0                PWM3DCLbits.PWM3DCL0            // bit 0
#define PWM3DCL1                PWM3DCLbits.PWM3DCL1            // bit 1
#define PWM3DCL2                PWM3DCLbits.PWM3DCL2            // bit 2
#define PWM3DCL3                PWM3DCLbits.PWM3DCL3            // bit 3
#define PWM3DCL4                PWM3DCLbits.PWM3DCL4            // bit 4
#define PWM3DCL5                PWM3DCLbits.PWM3DCL5            // bit 5
#define PWM3DCL6                PWM3DCLbits.PWM3DCL6            // bit 6
#define PWM3DCL7                PWM3DCLbits.PWM3DCL7            // bit 7

#define PWM3OFH0                PWM3OFHbits.PWM3OFH0            // bit 0
#define PWM3OFH1                PWM3OFHbits.PWM3OFH1            // bit 1
#define PWM3OFH2                PWM3OFHbits.PWM3OFH2            // bit 2
#define PWM3OFH3                PWM3OFHbits.PWM3OFH3            // bit 3
#define PWM3OFH4                PWM3OFHbits.PWM3OFH4            // bit 4
#define PWM3OFH5                PWM3OFHbits.PWM3OFH5            // bit 5
#define PWM3OFH6                PWM3OFHbits.PWM3OFH6            // bit 6
#define PWM3OFH7                PWM3OFHbits.PWM3OFH7            // bit 7

#define PWM3OFL0                PWM3OFLbits.PWM3OFL0            // bit 0
#define PWM3OFL1                PWM3OFLbits.PWM3OFL1            // bit 1
#define PWM3OFL2                PWM3OFLbits.PWM3OFL2            // bit 2
#define PWM3OFL3                PWM3OFLbits.PWM3OFL3            // bit 3
#define PWM3OFL4                PWM3OFLbits.PWM3OFL4            // bit 4
#define PWM3OFL5                PWM3OFLbits.PWM3OFL5            // bit 5
#define PWM3OFL6                PWM3OFLbits.PWM3OFL6            // bit 6
#define PWM3OFL7                PWM3OFLbits.PWM3OFL7            // bit 7

#define PWM3PHH0                PWM3PHHbits.PWM3PHH0            // bit 0
#define PWM3PHH1                PWM3PHHbits.PWM3PHH1            // bit 1
#define PWM3PHH2                PWM3PHHbits.PWM3PHH2            // bit 2
#define PWM3PHH3                PWM3PHHbits.PWM3PHH3            // bit 3
#define PWM3PHH4                PWM3PHHbits.PWM3PHH4            // bit 4
#define PWM3PHH5                PWM3PHHbits.PWM3PHH5            // bit 5
#define PWM3PHH6                PWM3PHHbits.PWM3PHH6            // bit 6
#define PWM3PHH7                PWM3PHHbits.PWM3PHH7            // bit 7

#define PWM3PHL0                PWM3PHLbits.PWM3PHL0            // bit 0
#define PWM3PHL1                PWM3PHLbits.PWM3PHL1            // bit 1
#define PWM3PHL2                PWM3PHLbits.PWM3PHL2            // bit 2
#define PWM3PHL3                PWM3PHLbits.PWM3PHL3            // bit 3
#define PWM3PHL4                PWM3PHLbits.PWM3PHL4            // bit 4
#define PWM3PHL5                PWM3PHLbits.PWM3PHL5            // bit 5
#define PWM3PHL6                PWM3PHLbits.PWM3PHL6            // bit 6
#define PWM3PHL7                PWM3PHLbits.PWM3PHL7            // bit 7

#define PWM3PRH0                PWM3PRHbits.PWM3PRH0            // bit 0
#define PWM3PRH1                PWM3PRHbits.PWM3PRH1            // bit 1
#define PWM3PRH2                PWM3PRHbits.PWM3PRH2            // bit 2
#define PWM3PRH3                PWM3PRHbits.PWM3PRH3            // bit 3
#define PWM3PRH4                PWM3PRHbits.PWM3PRH4            // bit 4
#define PWM3PRH5                PWM3PRHbits.PWM3PRH5            // bit 5
#define PWM3PRH6                PWM3PRHbits.PWM3PRH6            // bit 6
#define PWM3PRH7                PWM3PRHbits.PWM3PRH7            // bit 7

#define PWM3PRL0                PWM3PRLbits.PWM3PRL0            // bit 0
#define PWM3PRL1                PWM3PRLbits.PWM3PRL1            // bit 1
#define PWM3PRL2                PWM3PRLbits.PWM3PRL2            // bit 2
#define PWM3PRL3                PWM3PRLbits.PWM3PRL3            // bit 3
#define PWM3PRL4                PWM3PRLbits.PWM3PRL4            // bit 4
#define PWM3PRL5                PWM3PRLbits.PWM3PRL5            // bit 5
#define PWM3PRL6                PWM3PRLbits.PWM3PRL6            // bit 6
#define PWM3PRL7                PWM3PRLbits.PWM3PRL7            // bit 7

#define PWM3TMRH0               PWM3TMRHbits.PWM3TMRH0          // bit 0
#define PWM3TMRH1               PWM3TMRHbits.PWM3TMRH1          // bit 1
#define PWM3TMRH2               PWM3TMRHbits.PWM3TMRH2          // bit 2
#define PWM3TMRH3               PWM3TMRHbits.PWM3TMRH3          // bit 3
#define PWM3TMRH4               PWM3TMRHbits.PWM3TMRH4          // bit 4
#define PWM3TMRH5               PWM3TMRHbits.PWM3TMRH5          // bit 5
#define PWM3TMRH6               PWM3TMRHbits.PWM3TMRH6          // bit 6
#define PWM3TMRH7               PWM3TMRHbits.PWM3TMRH7          // bit 7

#define PWM3TMRL0               PWM3TMRLbits.PWM3TMRL0          // bit 0
#define PWM3TMRL1               PWM3TMRLbits.PWM3TMRL1          // bit 1
#define PWM3TMRL2               PWM3TMRLbits.PWM3TMRL2          // bit 2
#define PWM3TMRL3               PWM3TMRLbits.PWM3TMRL3          // bit 3
#define PWM3TMRL4               PWM3TMRLbits.PWM3TMRL4          // bit 4
#define PWM3TMRL5               PWM3TMRLbits.PWM3TMRL5          // bit 5
#define PWM3TMRL6               PWM3TMRLbits.PWM3TMRL6          // bit 6
#define PWM3TMRL7               PWM3TMRLbits.PWM3TMRL7          // bit 7

